Repository: CofficLab/GitOK
Catalog: Packages/PluginGitDiff/Resources/Localizable.xcstrings
Source language: en
Languages: zh_hans, zh_hk

source: Any view asks for a diff between two refs or files.
zh_hans: 任何视图都可在两个引用或文件间请求差异。
zh_hk: 任何視圖都可在兩個引用或文件間請求差異。

source: Choose a changed file to see its diff.
zh_hans: 选择变更文件以查看差异。
zh_hk: 選擇變更檔案以查看差異。

source: Compare old and new content in parallel columns.
zh_hans: 新旧内容并行分列对比。
zh_hk: 新舊內容並行分列對比。

source: Core Capabilities
zh_hans: 核心能力
zh_hk: 核心能力

source: Diff
zh_hans: 差异
zh_hk: 差異

source: Diff made legible — hunk by hunk, line by line.
zh_hans: 差异清晰可读——逐块、逐行。
zh_hk: 差異清晰可讀——逐塊、逐行。

source: Git's diff output is split into structured hunks.
zh_hans: git 的差异输出被拆分为结构化代码块。
zh_hk: git 的差異輸出被拆分為結構化代碼塊。

source: How It Works
zh_hans: 工作原理
zh_hk: 工作原理

source: Hunk Navigation
zh_hans: 代码块导航
zh_hk: 代碼塊導航

source: Hunks render inline or side-by-side with highlights.
zh_hans: 代码块以行内或并排方式渲染并高亮。
zh_hk: 代碼塊以行內或並排方式渲染並高亮。

source: Inline
zh_hans: 行内
zh_hk: 行內

source: Intra-line changes are highlighted, not just whole lines.
zh_hans: 行内变化也被高亮，而不仅仅是整行。
zh_hk: 行內變化也被高亮，而不僅僅是整行。

source: Jump between every changed hunk with one key.
zh_hans: 一键在每一个变更块之间跳转。
zh_hk: 一鍵在每一個變更塊之間跳轉。

source: No Text Diff
zh_hans: 无文本差异
zh_hk: 無文字差異

source: Parse hunks
zh_hans: 解析代码块
zh_hk: 解析代碼塊

source: Render
zh_hans: 渲染
zh_hk: 渲染

source: Request the diff
zh_hans: 请求差异
zh_hk: 請求差異

source: Select a File
zh_hans: 选择文件
zh_hk: 選擇檔案

source: Side-by-Side
zh_hans: 并排对比
zh_hk: 並排對比

source: Side-by-side
zh_hans: 并排
zh_hk: 並排

source: This file has no parseable text diff.
zh_hans: 此文件没有可解析的文本差异。
zh_hk: 此檔案沒有可解析的文字差異。

source: Unable to Load Diff
zh_hans: 无法加载差异
zh_hk: 無法載入差異

source: Word Highlight
zh_hans: 词级高亮
zh_hk: 詞級高亮

source: Word-level
zh_hans: 词级
zh_hk: 詞級

source: granularity
zh_hans: 精细度
zh_hk: 精細度

source: view modes
zh_hans: 视图模式
zh_hk: 視圖模式
